app/controllers/players_controller.rb

    def index
        all = Player.all
---
SELECT "players".* FROM "players"

    def show
        if params[:filter] == "All"
            search = Player.where("first_name LIKE ?", "#{params[:search]}%".titleize()) | Player.where("last_name LIKE ?", "#{params[:search]}%".titleize()) |
            Player.where("concat_ws(' ', first_name, last_name) LIKE ?", "%#{params[:search]}%".titleize())
            search = search.sort_by { |a| [ a.last_name, a.first_name ] }
            render json: search
        else
            team_filter = Player.where(plays_for_team: params[:filter])
            search = team_filter.where("first_name LIKE ?", "#{params[:search]}%".titleize()) | team_filter.where("last_name LIKE ?", "#{params[:search]}%".titleize()) |
---
SELECT "players".* FROM "players" WHERE "players"."first_name" = $1  [["first_name", "James"]]
SELECT "players".* FROM "players" WHERE "players"."first_name" = $1 LIMIT $2  [["first_name", "sad"], ["LIMIT", 11]]
SELECT "players".* FROM "players" WHERE "players"."first_name" = $1 LIMIT $2  [["first_name", "James"], ["LIMIT", 11]]